tap "azure/azd"
tap "microsoft/foundrylocal"
brew "openssl@3"
brew "readline"
brew "awscli"
brew "azure-cli"
brew "freetype"
brew "glib"
brew "cairo"
brew "cocoapods"
brew "duti"
brew "enchant"
brew "gh"
brew "golangci-lint"
brew "lsusb"
brew "mongosh"
brew "nginx", restart_service: :changed
brew "pkgconf"
brew "pngquant"
brew "pnpm"
brew "poppler"
brew "pure"
brew "pyenv"
brew "python@3.12"
brew "rbenv"
brew "redis"
brew "sdl2"
brew "sdl2_image"
brew "sdl2_mixer"
brew "supervisor"
brew "yarn"
brew "z"
brew "azure/azd/azd"
cask "claude"
cask "claude-code"
cask "copilot-cli"
cask "discord"
cask "docker-desktop"
cask "google-chrome"
cask "iterm2"
cask "keycastr"
cask "maccy"
cask "microsoft-edge"
cask "obs"
cask "postman"
cask "rar"
cask "teamviewer"
cask "temurin"
cask "the-unarchiver"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "wkhtmltopdf"
vscode "amandeepmittal.pug"
vscode "anthropic.claude-code"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "donjayamanne.python-environment-manager"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "mechatroner.rainbow-csv"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "mtxr.sqltools-driver-sqlite"
vscode "shopify.ruby-lsp"
vscode "streetsidesoftware.code-spell-checker"
vscode "syler.sass-indented"
vscode "tonybaloney.vscode-pets"
vscode "twixes.pypi-assistant"
vscode "vue.volar"
vscode "yzhang.markdown-all-in-one"
uv "pre-commit"
uv "specify-cli"
